name = ARGV[0]

if (Gem.win_platform? && ARGV[0])
    name = name.encode(ARGV[0])
        .force_encoding("IBM866")
        .encode("IBM866", "cp1251")
        .encode("UTF-8")
end

if name == nil
    name = "Анонимус"
end

puts "Добрый день, #{name}! Ответьте на вопросы.
1-да
2-нет\n" 

questions = [
    "Если ваш партнер бросает взгляд на незнакомую женщину, вы устраиваете ему скандал прямо на улице?",
    "Если ваш партнер опаздывает на ужин, вы уверены, что он был с другой?",
    "Вы расспрашиваете его о работе, о коллегах?",
    "Вы считаете, что каждую свободную минуту должны проводить вместе?",
    "Он для вас — свет в окошке?",
    "Случается ли вам проверять его корреспонденцию и рыться в его вещах?",
    "Чем чаще он говорит о своих чувствах, тем меньше вы верите?",
    "Вы хотите, чтобы он интересовался только тем, чем интересуетесь вы?",
    "Вы всегда спрашиваете у него, куда он ходит и с кем встречается?",
    "Если вы на него обижены, то молчите по нескольку дней?",
    "Вас мучают мысли о его бывшей возлюбленной?",
    "Он утверждает, что не ревнует вас, потому что доверяет. Для вас это означает, что любовь прошла?"
]

results = [
    # 10 и более ответов «да»
    "Вы болезненно ревнивы. Не думайте, что если избранник вас любит, " +
    "то он автоматически становится вашей собственностью. Вы считаете себя непривлекательной " +
    "и боитесь, что он бросит вас ради какой нибудь красавицы. Вы ни в чем не уверены, особенно " +
    "в нем. Задумайтесь над этим, потому что нельзя быть настолько ревнивой и агрессивной, это " +
    "может привести к конфликтам и даже к разрыву отношений.",

    # 5–9 ответов «да»
    "Ваша ревность действует на вас мобилизующе, но не она одна управляет вашим поведением. " +
    "В минуту слабости случается и вам устраивать скандалы.Но, успокоившись, вы понимаете, " +
    "что для вашей ревности не было никаких оснований.",

    # Менее 5 ответов «да»
    "Вам совершенно незнакомо чувство ревности. Но тревога и беспокойство могут накапливаться " +
    "со временем.Вы должны решать волнующие вас проблемы со своим партнером.",
    # 0 ответов «да»
    "Вы совершенно не знакомы с понятием ревность! Поздравляем!"
]

yes_answer = 0

for item in questions do 
    puts item

    user_input = nil

    while (user_input != "1" && user_input != "2")
        puts "Введите '1' или '2' и нажмите 'Enter' !"
        user_input = STDIN.gets.chomp.downcase 
    end

    if (user_input == "1")
        yes_answer += 1
    end
end

puts "\n#{name}"

puts "\nВаш результат теста: (У вас #{yes_answer} ответов 'Да')"

if  (yes_answer >= 10)
    puts results[0]
elsif (yes_answer >= 5)
    puts results[1]
elsif (yes_answer > 0)
    puts results[2]
else
    puts results[3]
end





